#+TITLE: Concurrent Programming
#+DATE: 2023-10-02 13:00:12
#+DISPLAY: t
#+STARTUP: indent
#+OPTIONS: toc:10
#+AUTHOR: inmove
#+SUBTITLE: Concurrent programming is a form of computing in which several computations are executed during overlapping time periods—concurrently—instead of sequentially
#+KEYWORDS: Thread Process Coroutine
#+CATEGORIES: Python

* Cancel task
#+CAPTION: cancel task
#+begin_src python :results output :noweb yes
  import asyncio
  async def risky_task():
      try:
          await asyncio.sleep(10)
      except asyncio.CancelledError:
          print("Task was cancelled")

  async def main():
      task = asyncio.create_task(risky_task())
      await asyncio.sleep(1)
      task.cancel()
      await task

  asyncio.run(main())

#+end_src

#+RESULTS:
: Task was cancelled
